Revit 2027 API
DistributionSysTypeSet Methods
The DistributionSysTypeSet type exposes the following members.
Methods
Name | Description
Clear | Removes every DistributionSys type from the set, rendering it empty.
Contains | Tests for the existence of a DistributionSys type within the set.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase | Removes a specified DistributionSys type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified DistributionSys type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace